cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'ack'
brew 'coreutils'
brew 'go'
brew 'grc'
brew 'imagemagick'
brew 'jp2a'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'openssl'
brew 'node'
brew 'readline'
brew 'postgresql'
brew 'ruby-build'
brew 'roundup'
brew 'spaceman-diff'
brew 'spark'
brew 'unrar'
brew 'wget'
brew 'youtube-dl'
cask '1password'
cask 'firefox'
cask 'google-chrome'
cask 'slack'
cask 'transmission'
# cask 'tunnelbear'
cask 'vlc'

brew 'apple-gcc42'
brew 'hub'
brew 'nvm'
brew 'tmate'
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'postgresql'