cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'ack'
brew 'ctags'
brew 'coreutils'
brew 'go'
brew 'grc'
brew 'imagemagick'
cask 'xquartz'
brew 'jp2a'
brew 'libcaca', args: ['with-imlib2']
brew 'git'
brew 'libgit2'
brew 'openssl'
brew 'node'
brew 'readline'
brew 'postgresql'
brew 'roundup'
brew 'spaceman-diff'
brew 'ffmpeg' # convert all the vids and audio
brew 'unrar'
brew 'wget'
brew 'youtube-dl'
cask 'firefox'
brew 'vim' # for upgrading and such
brew 'macvim' # for janus
cask 'vlc'
brew 'gpg'
cask 'flux'
# cask '1password', has to be installed for github ssh and such
cask 'google-chrome'
cask 'slack'
cask 'transmission'
cask 'iterm2'
cask 'brave'
cask 'spotify'
cask 'gitter'

brew 'tmate'
brew 'hub'
brew 'nvm'
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'postgresql'
brew 'gotags'
